In [2]:
import pandas as pd

In [3]:
data=pd.read_csv("Dataset.csv")
data

         Date  Student ID   Class  Study Hrs  Percentege
0  01-07-2019       1001.0     10        2.0        50.0
1  02-07-2019       1002.0     10        NaN        80.0
2  03-07-2019          NaN     10        3.0        60.0
3  06-07-2019          NaN     11        0.0         NaN
4  07-07-2019       1005.0     11        4.0         NaN
5  08-07-2019          NaN     11       10.0         NaN
6  09-07-2019       1007.0     12        4.0        80.0
7  10-07-2019       1008.0     12        NaN        90.0
8  11-07-2019       1009.0     12        NaN        60.0
9  12-07-2019       1010.0     12        6.0        85.0

In [5]:
data.loc[0]

Date           01-07-2019
Student ID           1001
Class                  10
Study Hrs               2
Percentege             50
Name: 0, dtype: object

In [6]:
data.loc[[0,1,2]]

         Date  Student ID   Class  Study Hrs  Percentege
0  01-07-2019       1001.0     10        2.0        50.0
1  02-07-2019       1002.0     10        NaN        80.0
2  03-07-2019          NaN     10        3.0        60.0

In [7]:
data.loc[[0]]

         Date  Student ID   Class  Study Hrs  Percentege
0  01-07-2019       1001.0     10        2.0        50.0

In [8]:
data.loc[4,"Date"]

'07-07-2019'

In [9]:
data.loc[1:4,"Date"]

1    02-07-2019
2    03-07-2019
3    06-07-2019
4    07-07-2019
Name: Date, dtype: object

In [13]:
data.loc[[False,False,True,False,False,True,False,False,True,False]]

         Date  Student ID   Class  Study Hrs  Percentege
2  03-07-2019          NaN     10        3.0        60.0
5  08-07-2019          NaN     11       10.0         NaN
8  11-07-2019       1009.0     12        NaN        60.0

In [15]:
data.loc[data['Class']<11]

         Date  Student ID   Class  Study Hrs  Percentege
0  01-07-2019       1001.0     10        2.0        50.0
1  02-07-2019       1002.0     10        NaN        80.0
2  03-07-2019          NaN     10        3.0        60.0

In [16]:
data.loc[data['Class']<11,["Percentege"]]

   Percentege
0        50.0
1        80.0
2        60.0

In [17]:
data.iloc[0]

Date           01-07-2019
Student ID           1001
Class                  10
Study Hrs               2
Percentege             50
Name: 0, dtype: object

In [18]:
data.loc[0]

Date           01-07-2019
Student ID           1001
Class                  10
Study Hrs               2
Percentege             50
Name: 0, dtype: object

In [19]:
data.iloc[[1,2,3]]

         Date  Student ID   Class  Study Hrs  Percentege
1  02-07-2019       1002.0     10        NaN        80.0
2  03-07-2019          NaN     10        3.0        60.0
3  06-07-2019          NaN     11        0.0         NaN

In [20]:
data.iloc[:,0]

0    01-07-2019
1    02-07-2019
2    03-07-2019
3    06-07-2019
4    07-07-2019
5    08-07-2019
6    09-07-2019
7    10-07-2019
8    11-07-2019
9    12-07-2019
Name: Date, dtype: object

In [21]:
data.iloc[[0,1]]

         Date  Student ID   Class  Study Hrs  Percentege
0  01-07-2019       1001.0     10        2.0        50.0
1  02-07-2019       1002.0     10        NaN        80.0

In [23]:
data.iloc[[True,False,False,True,False,False,True,False,False,True]]

         Date  Student ID   Class  Study Hrs  Percentege
0  01-07-2019       1001.0     10        2.0        50.0
3  06-07-2019          NaN     11        0.0         NaN
6  09-07-2019       1007.0     12        4.0        80.0
9  12-07-2019       1010.0     12        6.0        85.0